# BuiltInFailures.DocumentFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..DocumentFailures Members
BuiltInFailures..::..DocumentFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..DocumentFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ApiDelayedUpdateFailed | Delayed Updating Failed. Please contact the 3rd Party Application vendor. |
| CannotAutoUpdate | Coordination Monitor can't update element |
| CannotLoadLink | Can't load Linked File [Name] due to errors. Open it separately to investigate the problem. |
| DUExcessiveRegeneration | Third party updater '[Name]' has caused an infinite loop and its action had to be canceled. |
| DUMisbehavingUpdater | Third party updater '[Name]' has experienced a problem and its action had to be canceled. |

# See Also
BuiltInFailures..::..DocumentFailures Class
Autodesk.Revit.DB Namespace